20240120133545-writing_final_methods.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-02 Mon 08:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Writing Final Methods</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Writing Final Methods</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9c9094d">1. Writing Final Methods</a>
<ul>
<li><a href="#org34c9325">1.1. Example</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9c9094d" class="outline-2">
<h2 id="org9c9094d"><span class="section-number-2">1.</span> Writing Final Methods</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>final</code> methods <b>cannot</b> be <a href="20240120133450-overriding_a_method.html#ID-c67b24a4-82f7-4423-83a9-75fc1c566166">overriden</a>.
By marking a method <code>final</code>, you forbid a <code>child</code> class from replacing this method.
</p>

<p>
This rule is in place both when you <a href="20240120133450-overriding_a_method.html#ID-c67b24a4-82f7-4423-83a9-75fc1c566166">override a method</a> and when you <b>hide</b> a method.
</p>

<p>
In other words, you <b>cannot</b> <a href="20240120133516-hiding_static_methods.html#ID-19ea09af-1aa5-4247-b608-13333950e8c0">hiding a static method</a> in a <code>child</code> class if it is marked <code>final</code> in the <code>parent</code> class.
</p>
</div>

<div id="outline-container-org34c9325" class="outline-3">
<h3 id="org34c9325"><span class="section-number-3">1.1.</span> Example</h3>
<div class="outline-text-3" id="text-1-1">
<p>
In this example, the instance method <code>hasFeathers()</code> is marked as <code>final</code> in the <code>parent</code> class <code>Bird</code>, so the <code>child</code> class <code>Penguin</code> <b>cannot</b> override the <code>parent</code> method, resulting in
a <b>compiler error</b>.
</p>

<p>
The <code>static</code> method <code>flyAway()</code> is also marked <code>final</code>, so it cannot be hidden in the <code>subclass</code>.
</p>

<p>
In this example, whether or not the child method uses the <code>final</code> keyword is <b>irrelevant</b> ­ the code will <b>not compile</b> either way.
</p>

<p>
This rule applies only to <b>inherited</b> methods.
</p>

<p>
For example, if the two methods were marked <code>private</code> in the <code>parent</code> <code>Bird</code> class, then the <code>Penguin</code> class, as defined, <b>would compile</b>.
</p>

<p>
In that case, the <code>private</code> methods would be <b>redeclared</b>, <b>not overridden or hidden</b>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Bird</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">final</span> <span class="org-type">boolean</span> <span class="org-function-name">hasFeathers</span>() {
        <span class="org-keyword">return</span> <span class="org-constant">true</span>;
    }
    <span class="org-keyword">public</span> <span class="org-keyword">final</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">flyAway</span>() {}
}

<span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Penguin</span> <span class="org-keyword">extends</span> <span class="org-type">Bird</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">final</span> <span class="org-type">boolean</span> <span class="org-function-name">hasFeathers</span>() { <span class="org-comment-delimiter">// </span><span class="org-comment">DOES NOT COMPILE
</span>        <span class="org-keyword">return</span> <span class="org-constant">false</span>;
    }
    <span class="org-keyword">public</span> <span class="org-keyword">final</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">flyAway</span>() {} <span class="org-comment-delimiter">// </span><span class="org-comment">DOES NOT COMPILE
</span>}
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
